{
  "projectName": ".NET nanoFramework",
  "showProjectName": true,
  "imageFileName": "nanoframework.png",
  "gitHubOrg": "nanoframework",
  "gitHubRepoName": "home",
  "transcriptFileName": "",
  "publishDate": "2021-9-01",
  "loadIssues": true,
  "issueLabel": "help wanted",
  "showContributers": true,
  "projectOwners": [
    {
      "name": "José Simões",
      "url": "https://github.com/josesimoes"
    }
  ],
  "youtubeUrl": "https://www.youtube.com/embed/l8g5SUX5Zok",
  "projectDescription": ".NET nanoFramework is a free and open-source platform that enables the writing of managed code applications for constrained embedded devices. It is suitable for many types of projects including IoT sensors, wearables, academic proof of concept, robotics, hobbyist/makers creations or even complex industrial equipment. It makes the development for such platforms easier, faster and less costly by giving embedded developers access to modern technologies and tools used by desktop application developers.<br /><br />Developers can harness the powerful and familiar Microsoft Visual Studio IDE and their .NET C# knowledge to quickly write code without having to worry about the low-level hardware intricacies of a microcontroller. Desktop .NET developers will feel “at home” and are able to use their skills in embedded systems development, enlarging the pool of qualified embedded developers.<br /><br />It includes a reduced version of the .NET Common Language Runtime (CLR) and features a subset of the .NET base class libraries along with the most common APIs included in the .NET Core allowing code reuse from desktop applications, IoT Core applications, thousands of code examples and open source projects.<br/><br />Using Microsoft Visual Studio, a developer can deploy and debug the code directly on real hardware.",
  "contributors": [
    {
      "name": "cw2",
      "url": "https://github.com/cw2"
    },
    {
      "name": "Mateusz Klatecki",
      "url": "https://github.com/MateuszKlatecki"
    },
    {
      "name": "Robb Schiefer",
      "url": "https://github.com/rschiefer"
    },
    {
      "name": "Terry Fogg",
      "url": "https://github.com/TerryFogg"
    },
    {
      "name": "Sascha Corti",
      "url": "https://github.com/TechPreacher"
    }
  ],
  "githubRepo": "https://github.com/nanoframework",
  "projectWebsite": "https://www.nanoframework.net/",
  "documentationUrl": "https://docs.nanoframework.net/",
  "communityUrl": "https://discord.gg/gCyBu8T",
  "contributionUrl": "https://docs.nanoframework.net/content/contributing/index.html"
}
